7767517
274 326
Input                    in0                      0 1 in0 -23330=5,3,320,320,1,3 0=320 1=320 2=3
Convolution              conv_3                   1 1 in0 1 -23330=5,3,160,160,1,16 0=16 1=3 3=2 4=1 5=1 6=432
Swish                    silu_87                  1 1 1 2 -23330=5,3,160,160,1,16
Convolution              conv_4                   1 1 2 3 -23330=5,3,80,80,1,32 0=32 1=3 3=2 4=1 5=1 6=4608
Swish                    silu_88                  1 1 3 4 -23330=5,3,80,80,1,32
Convolution              conv_5                   1 1 4 5 -23330=5,3,80,80,1,32 0=32 1=1 5=1 6=1024
Swish                    silu_89                  1 1 5 6 -23330=5,3,80,80,1,32
Slice                    split_0                  1 2 6 7 8 -23330=10,3,80,80,1,16,3,80,80,1,16 -23300=2,16,16
Split                    splitncnn_0              1 3 8 9 10 11 -23330=15,3,80,80,1,16,3,80,80,1,16,3,80,80,1,16
Convolution              conv_6                   1 1 11 12 -23330=5,3,80,80,1,8 0=8 1=3 4=1 5=1 6=1152
Swish                    silu_90                  1 1 12 13 -23330=5,3,80,80,1,8
Convolution              conv_7                   1 1 13 14 -23330=5,3,80,80,1,16 0=16 1=3 4=1 5=1 6=1152
Swish                    silu_91                  1 1 14 15 -23330=5,3,80,80,1,16
BinaryOp                 add_0                    2 1 10 15 16 -23330=5,3,80,80,1,16
Concat                   cat_0                    3 1 7 9 16 17 -23330=5,3,80,80,1,48
Convolution              conv_8                   1 1 17 18 -23330=5,3,80,80,1,64 0=64 1=1 5=1 6=3072
Swish                    silu_92                  1 1 18 19 -23330=5,3,80,80,1,64
Convolution              conv_9                   1 1 19 20 -23330=5,3,40,40,1,64 0=64 1=3 3=2 4=1 5=1 6=36864
Swish                    silu_93                  1 1 20 21 -23330=5,3,40,40,1,64
Convolution              conv_10                  1 1 21 22 -23330=5,3,40,40,1,64 0=64 1=1 5=1 6=4096
Swish                    silu_94                  1 1 22 23 -23330=5,3,40,40,1,64
Slice                    split_1                  1 2 23 24 25 -23330=10,3,40,40,1,32,3,40,40,1,32 -23300=2,32,32
Split                    splitncnn_1              1 3 25 26 27 28 -23330=15,3,40,40,1,32,3,40,40,1,32,3,40,40,1,32
Convolution              conv_11                  1 1 28 29 -23330=5,3,40,40,1,16 0=16 1=3 4=1 5=1 6=4608
Swish                    silu_95                  1 1 29 30 -23330=5,3,40,40,1,16
Convolution              conv_12                  1 1 30 31 -23330=5,3,40,40,1,32 0=32 1=3 4=1 5=1 6=4608
Swish                    silu_96                  1 1 31 32 -23330=5,3,40,40,1,32
BinaryOp                 add_1                    2 1 27 32 33 -23330=5,3,40,40,1,32
Concat                   cat_1                    3 1 24 26 33 34 -23330=5,3,40,40,1,96
Convolution              conv_13                  1 1 34 35 -23330=5,3,40,40,1,128 0=128 1=1 5=1 6=12288
Swish                    silu_97                  1 1 35 36 -23330=5,3,40,40,1,128
Split                    splitncnn_2              1 2 36 37 38 -23330=10,3,40,40,1,128,3,40,40,1,128
Convolution              conv_14                  1 1 38 39 -23330=5,3,20,20,1,128 0=128 1=3 3=2 4=1 5=1 6=147456
Swish                    silu_98                  1 1 39 40 -23330=5,3,20,20,1,128
Convolution              conv_15                  1 1 40 41 -23330=5,3,20,20,1,128 0=128 1=1 5=1 6=16384
Swish                    silu_99                  1 1 41 42 -23330=5,3,20,20,1,128
Slice                    split_2                  1 2 42 43 44 -23330=10,3,20,20,1,64,3,20,20,1,64 -23300=2,64,64
Split                    splitncnn_3              1 3 44 45 46 47 -23330=15,3,20,20,1,64,3,20,20,1,64,3,20,20,1,64
Convolution              conv_16                  1 1 47 48 -23330=5,3,20,20,1,32 0=32 1=1 5=1 6=2048
Swish                    silu_100                 1 1 48 49 -23330=5,3,20,20,1,32
Split                    splitncnn_4              1 2 49 50 51 -23330=10,3,20,20,1,32,3,20,20,1,32
Convolution              conv_17                  1 1 51 52 -23330=5,3,20,20,1,32 0=32 1=3 4=1 5=1 6=9216
Swish                    silu_101                 1 1 52 53 -23330=5,3,20,20,1,32
Convolution              conv_18                  1 1 53 54 -23330=5,3,20,20,1,32 0=32 1=3 4=1 5=1 6=9216
Swish                    silu_102                 1 1 54 55 -23330=5,3,20,20,1,32
BinaryOp                 add_2                    2 1 50 55 56 -23330=5,3,20,20,1,32
Split                    splitncnn_5              1 2 56 57 58 -23330=10,3,20,20,1,32,3,20,20,1,32
Convolution              conv_19                  1 1 58 59 -23330=5,3,20,20,1,32 0=32 1=3 4=1 5=1 6=9216
Swish                    silu_103                 1 1 59 60 -23330=5,3,20,20,1,32
Convolution              conv_20                  1 1 60 61 -23330=5,3,20,20,1,32 0=32 1=3 4=1 5=1 6=9216
Swish                    silu_104                 1 1 61 62 -23330=5,3,20,20,1,32
BinaryOp                 add_3                    2 1 57 62 63 -23330=5,3,20,20,1,32
Convolution              conv_21                  1 1 46 64 -23330=5,3,20,20,1,32 0=32 1=1 5=1 6=2048
Swish                    silu_105                 1 1 64 65 -23330=5,3,20,20,1,32
Concat                   cat_2                    2 1 63 65 66 -23330=5,3,20,20,1,64
Convolution              conv_22                  1 1 66 67 -23330=5,3,20,20,1,64 0=64 1=1 5=1 6=4096
Swish                    silu_106                 1 1 67 68 -23330=5,3,20,20,1,64
Concat                   cat_3                    3 1 43 45 68 69 -23330=5,3,20,20,1,192
Convolution              conv_23                  1 1 69 70 -23330=5,3,20,20,1,128 0=128 1=1 5=1 6=24576
Swish                    silu_107                 1 1 70 71 -23330=5,3,20,20,1,128
Split                    splitncnn_6              1 2 71 72 73 -23330=10,3,20,20,1,128,3,20,20,1,128
Convolution              conv_24                  1 1 73 74 -23330=5,3,10,10,1,256 0=256 1=3 3=2 4=1 5=1 6=294912
Swish                    silu_108                 1 1 74 75 -23330=5,3,10,10,1,256
Convolution              conv_25                  1 1 75 76 -23330=5,3,10,10,1,256 0=256 1=1 5=1 6=65536
Swish                    silu_109                 1 1 76 77 -23330=5,3,10,10,1,256
Slice                    split_3                  1 2 77 78 79 -23330=10,3,10,10,1,128,3,10,10,1,128 -23300=2,128,128
Split                    splitncnn_7              1 3 79 80 81 82 -23330=15,3,10,10,1,128,3,10,10,1,128,3,10,10,1,128
Convolution              conv_26                  1 1 82 83 -23330=5,3,10,10,1,64 0=64 1=1 5=1 6=8192
Swish                    silu_110                 1 1 83 84 -23330=5,3,10,10,1,64
Split                    splitncnn_8              1 2 84 85 86 -23330=10,3,10,10,1,64,3,10,10,1,64
Convolution              conv_27                  1 1 86 87 -23330=5,3,10,10,1,64 0=64 1=3 4=1 5=1 6=36864
Swish                    silu_111                 1 1 87 88 -23330=5,3,10,10,1,64
Convolution              conv_28                  1 1 88 89 -23330=5,3,10,10,1,64 0=64 1=3 4=1 5=1 6=36864
Swish                    silu_112                 1 1 89 90 -23330=5,3,10,10,1,64
BinaryOp                 add_4                    2 1 85 90 91 -23330=5,3,10,10,1,64
Split                    splitncnn_9              1 2 91 92 93 -23330=10,3,10,10,1,64,3,10,10,1,64
Convolution              conv_29                  1 1 93 94 -23330=5,3,10,10,1,64 0=64 1=3 4=1 5=1 6=36864
Swish                    silu_113                 1 1 94 95 -23330=5,3,10,10,1,64
Convolution              conv_30                  1 1 95 96 -23330=5,3,10,10,1,64 0=64 1=3 4=1 5=1 6=36864
Swish                    silu_114                 1 1 96 97 -23330=5,3,10,10,1,64
BinaryOp                 add_5                    2 1 92 97 98 -23330=5,3,10,10,1,64
Convolution              conv_31                  1 1 81 99 -23330=5,3,10,10,1,64 0=64 1=1 5=1 6=8192
Swish                    silu_115                 1 1 99 100 -23330=5,3,10,10,1,64
Concat                   cat_4                    2 1 98 100 101 -23330=5,3,10,10,1,128
Convolution              conv_32                  1 1 101 102 -23330=5,3,10,10,1,128 0=128 1=1 5=1 6=16384
Swish                    silu_116                 1 1 102 103 -23330=5,3,10,10,1,128
Concat                   cat_5                    3 1 78 80 103 104 -23330=5,3,10,10,1,384
Convolution              conv_33                  1 1 104 105 -23330=5,3,10,10,1,256 0=256 1=1 5=1 6=98304
Swish                    silu_117                 1 1 105 106 -23330=5,3,10,10,1,256
Convolution              conv_34                  1 1 106 107 -23330=5,3,10,10,1,128 0=128 1=1 5=1 6=32768
Split                    splitncnn_10             1 2 107 108 109 -23330=10,3,10,10,1,128,3,10,10,1,128
Pooling                  maxpool2d_84             1 1 109 110 -23330=5,3,10,10,1,128 1=5 3=2 5=1
Split                    splitncnn_11             1 2 110 111 112 -23330=10,3,10,10,1,128,3,10,10,1,128
Pooling                  maxpool2d_85             1 1 112 113 -23330=5,3,10,10,1,128 1=5 3=2 5=1
Split                    splitncnn_12             1 2 113 114 115 -23330=10,3,10,10,1,128,3,10,10,1,128
Pooling                  maxpool2d_86             1 1 115 116 -23330=5,3,10,10,1,128 1=5 3=2 5=1
Concat                   cat_6                    4 1 108 111 114 116 117 -23330=5,3,10,10,1,512
Convolution              conv_35                  1 1 117 118 -23330=5,3,10,10,1,256 0=256 1=1 5=1 6=131072
Swish                    silu_118                 1 1 118 119 -23330=5,3,10,10,1,256
Convolution              conv_36                  1 1 119 120 -23330=5,3,10,10,1,256 0=256 1=1 5=1 6=65536
Swish                    silu_119                 1 1 120 121 -23330=5,3,10,10,1,256
Slice                    split_4                  1 2 121 122 123 -23330=10,3,10,10,1,128,3,10,10,1,128 -23300=2,128,128
Split                    splitncnn_13             1 2 123 124 125 -23330=10,3,10,10,1,128,3,10,10,1,128
Convolution              conv_37                  1 1 125 126 -23330=5,3,10,10,1,256 0=256 1=1 5=1 6=32768
Reshape                  reshape_165              1 1 126 127 -23330=5,3,100,128,1,2 0=100 1=128 2=2
Slice                    split_5                  1 3 127 128 129 130 -23330=15,3,100,32,1,2,3,100,32,1,2,3,100,64,1,2 -23300=3,32,32,64 1=1
Split                    splitncnn_14             1 2 130 131 132 -23330=10,3,100,64,1,2,3,100,64,1,2
Permute                  transpose_179            1 1 128 133 -23330=5,3,32,100,1,2 0=1
MatMul                   matmul_177               2 1 133 129 134 -23330=5,3,100,100,1,2
BinaryOp                 mul_6                    1 1 134 135 -23330=5,3,100,100,1,2 0=2 1=1 2=1.767767e-01
Softmax                  softmax_1                1 1 135 136 -23330=5,3,100,100,1,2 0=2 1=1
MatMul                   matmultransb_0           2 1 132 136 137 -23330=5,3,100,64,1,2 0=1
Reshape                  reshape_166              1 1 137 138 -23330=5,3,10,10,1,128 0=10 1=10 2=128
Reshape                  reshape_167              1 1 131 139 -23330=5,3,10,10,1,128 0=10 1=10 2=128
ConvolutionDepthWise     convdw_182               1 1 139 140 -23330=5,3,10,10,1,128 0=128 1=3 4=1 5=1 6=1152 7=128
BinaryOp                 add_7                    2 1 138 140 141 -23330=5,3,10,10,1,128
Convolution              conv_38                  1 1 141 142 -23330=5,3,10,10,1,128 0=128 1=1 5=1 6=16384
BinaryOp                 add_8                    2 1 124 142 143 -23330=5,3,10,10,1,128
Split                    splitncnn_15             1 2 143 144 145 -23330=10,3,10,10,1,128,3,10,10,1,128
Convolution              conv_39                  1 1 145 146 -23330=5,3,10,10,1,256 0=256 1=1 5=1 6=32768
Swish                    silu_120                 1 1 146 147 -23330=5,3,10,10,1,256
Convolution              conv_40                  1 1 147 148 -23330=5,3,10,10,1,128 0=128 1=1 5=1 6=32768
BinaryOp                 add_9                    2 1 144 148 149 -23330=5,3,10,10,1,128
Concat                   cat_7                    2 1 122 149 150 -23330=5,3,10,10,1,256
Convolution              conv_41                  1 1 150 151 -23330=5,3,10,10,1,256 0=256 1=1 5=1 6=65536
Swish                    silu_121                 1 1 151 152 -23330=5,3,10,10,1,256
Split                    splitncnn_16             1 2 152 153 154 -23330=10,3,10,10,1,256,3,10,10,1,256
Interp                   upsample_163             1 1 154 155 -23330=5,3,20,20,1,256 0=1 1=2.000000e+00 2=2.000000e+00
Concat                   cat_8                    2 1 155 72 156 -23330=5,3,20,20,1,384
Convolution              conv_42                  1 1 156 157 -23330=5,3,20,20,1,128 0=128 1=1 5=1 6=49152
Swish                    silu_122                 1 1 157 158 -23330=5,3,20,20,1,128
Slice                    split_6                  1 2 158 159 160 -23330=10,3,20,20,1,64,3,20,20,1,64 -23300=2,64,64
Split                    splitncnn_17             1 3 160 161 162 163 -23330=15,3,20,20,1,64,3,20,20,1,64,3,20,20,1,64
Convolution              conv_43                  1 1 163 164 -23330=5,3,20,20,1,32 0=32 1=3 4=1 5=1 6=18432
Swish                    silu_123                 1 1 164 165 -23330=5,3,20,20,1,32
Convolution              conv_44                  1 1 165 166 -23330=5,3,20,20,1,64 0=64 1=3 4=1 5=1 6=18432
Swish                    silu_124                 1 1 166 167 -23330=5,3,20,20,1,64
BinaryOp                 add_10                   2 1 162 167 168 -23330=5,3,20,20,1,64
Concat                   cat_9                    3 1 159 161 168 169 -23330=5,3,20,20,1,192
Convolution              conv_45                  1 1 169 170 -23330=5,3,20,20,1,128 0=128 1=1 5=1 6=24576
Swish                    silu_125                 1 1 170 171 -23330=5,3,20,20,1,128
Split                    splitncnn_18             1 2 171 172 173 -23330=10,3,20,20,1,128,3,20,20,1,128
Interp                   upsample_164             1 1 173 174 -23330=5,3,40,40,1,128 0=1 1=2.000000e+00 2=2.000000e+00
Concat                   cat_10                   2 1 174 37 175 -23330=5,3,40,40,1,256
Convolution              conv_46                  1 1 175 176 -23330=5,3,40,40,1,64 0=64 1=1 5=1 6=16384
Swish                    silu_126                 1 1 176 177 -23330=5,3,40,40,1,64
Slice                    split_7                  1 2 177 178 179 -23330=10,3,40,40,1,32,3,40,40,1,32 -23300=2,32,32
Split                    splitncnn_19             1 3 179 180 181 182 -23330=15,3,40,40,1,32,3,40,40,1,32,3,40,40,1,32
Convolution              conv_47                  1 1 182 183 -23330=5,3,40,40,1,16 0=16 1=3 4=1 5=1 6=4608
Swish                    silu_127                 1 1 183 184 -23330=5,3,40,40,1,16
Convolution              conv_48                  1 1 184 185 -23330=5,3,40,40,1,32 0=32 1=3 4=1 5=1 6=4608
Swish                    silu_128                 1 1 185 186 -23330=5,3,40,40,1,32
BinaryOp                 add_11                   2 1 181 186 187 -23330=5,3,40,40,1,32
Concat                   cat_11                   3 1 178 180 187 188 -23330=5,3,40,40,1,96
Convolution              conv_49                  1 1 188 189 -23330=5,3,40,40,1,64 0=64 1=1 5=1 6=6144
Swish                    silu_129                 1 1 189 190 -23330=5,3,40,40,1,64
Split                    splitncnn_20             1 3 190 191 192 193 -23330=15,3,40,40,1,64,3,40,40,1,64,3,40,40,1,64
Convolution              conv_50                  1 1 192 194 -23330=5,3,20,20,1,64 0=64 1=3 3=2 4=1 5=1 6=36864
Swish                    silu_130                 1 1 194 195 -23330=5,3,20,20,1,64
Concat                   cat_12                   2 1 195 172 196 -23330=5,3,20,20,1,192
Convolution              conv_51                  1 1 196 197 -23330=5,3,20,20,1,128 0=128 1=1 5=1 6=24576
Swish                    silu_131                 1 1 197 198 -23330=5,3,20,20,1,128
Slice                    split_8                  1 2 198 199 200 -23330=10,3,20,20,1,64,3,20,20,1,64 -23300=2,64,64
Split                    splitncnn_21             1 3 200 201 202 203 -23330=15,3,20,20,1,64,3,20,20,1,64,3,20,20,1,64
Convolution              conv_52                  1 1 203 204 -23330=5,3,20,20,1,32 0=32 1=3 4=1 5=1 6=18432
Swish                    silu_132                 1 1 204 205 -23330=5,3,20,20,1,32
Convolution              conv_53                  1 1 205 206 -23330=5,3,20,20,1,64 0=64 1=3 4=1 5=1 6=18432
Swish                    silu_133                 1 1 206 207 -23330=5,3,20,20,1,64
BinaryOp                 add_12                   2 1 202 207 208 -23330=5,3,20,20,1,64
Concat                   cat_13                   3 1 199 201 208 209 -23330=5,3,20,20,1,192
Convolution              conv_54                  1 1 209 210 -23330=5,3,20,20,1,128 0=128 1=1 5=1 6=24576
Swish                    silu_134                 1 1 210 211 -23330=5,3,20,20,1,128
Split                    splitncnn_22             1 3 211 212 213 214 -23330=15,3,20,20,1,128,3,20,20,1,128,3,20,20,1,128
Convolution              conv_55                  1 1 213 215 -23330=5,3,10,10,1,128 0=128 1=3 3=2 4=1 5=1 6=147456
Swish                    silu_135                 1 1 215 216 -23330=5,3,10,10,1,128
Concat                   cat_14                   2 1 216 153 217 -23330=5,3,10,10,1,384
Convolution              conv_56                  1 1 217 218 -23330=5,3,10,10,1,256 0=256 1=1 5=1 6=98304
Swish                    silu_136                 1 1 218 219 -23330=5,3,10,10,1,256
Slice                    split_9                  1 2 219 220 221 -23330=10,3,10,10,1,128,3,10,10,1,128 -23300=2,128,128
Split                    splitncnn_23             1 3 221 222 223 224 -23330=15,3,10,10,1,128,3,10,10,1,128,3,10,10,1,128
Convolution              conv_57                  1 1 224 225 -23330=5,3,10,10,1,64 0=64 1=1 5=1 6=8192
Swish                    silu_137                 1 1 225 226 -23330=5,3,10,10,1,64
Split                    splitncnn_24             1 2 226 227 228 -23330=10,3,10,10,1,64,3,10,10,1,64
Convolution              conv_58                  1 1 228 229 -23330=5,3,10,10,1,64 0=64 1=3 4=1 5=1 6=36864
Swish                    silu_138                 1 1 229 230 -23330=5,3,10,10,1,64
Convolution              conv_59                  1 1 230 231 -23330=5,3,10,10,1,64 0=64 1=3 4=1 5=1 6=36864
Swish                    silu_139                 1 1 231 232 -23330=5,3,10,10,1,64
BinaryOp                 add_13                   2 1 227 232 233 -23330=5,3,10,10,1,64
Split                    splitncnn_25             1 2 233 234 235 -23330=10,3,10,10,1,64,3,10,10,1,64
Convolution              conv_60                  1 1 235 236 -23330=5,3,10,10,1,64 0=64 1=3 4=1 5=1 6=36864
Swish                    silu_140                 1 1 236 237 -23330=5,3,10,10,1,64
Convolution              conv_61                  1 1 237 238 -23330=5,3,10,10,1,64 0=64 1=3 4=1 5=1 6=36864
Swish                    silu_141                 1 1 238 239 -23330=5,3,10,10,1,64
BinaryOp                 add_14                   2 1 234 239 240 -23330=5,3,10,10,1,64
Convolution              conv_62                  1 1 223 241 -23330=5,3,10,10,1,64 0=64 1=1 5=1 6=8192
Swish                    silu_142                 1 1 241 242 -23330=5,3,10,10,1,64
Concat                   cat_15                   2 1 240 242 243 -23330=5,3,10,10,1,128
Convolution              conv_63                  1 1 243 244 -23330=5,3,10,10,1,128 0=128 1=1 5=1 6=16384
Swish                    silu_143                 1 1 244 245 -23330=5,3,10,10,1,128
Concat                   cat_16                   3 1 220 222 245 246 -23330=5,3,10,10,1,384
Convolution              conv_64                  1 1 246 247 -23330=5,3,10,10,1,256 0=256 1=1 5=1 6=98304
Swish                    silu_144                 1 1 247 248 -23330=5,3,10,10,1,256
Split                    splitncnn_26             1 2 248 249 250 -23330=10,3,10,10,1,256,3,10,10,1,256
MemoryData               pnnx_189                 0 1 251 -23330=5,1,2100,1,1,1 0=2100
Convolution              conv_65                  1 1 191 252 -23330=5,3,40,40,1,64 0=64 1=3 4=1 5=1 6=36864
Swish                    silu_145                 1 1 252 253 -23330=5,3,40,40,1,64
Convolution              conv_66                  1 1 253 254 -23330=5,3,40,40,1,64 0=64 1=3 4=1 5=1 6=36864
Swish                    silu_146                 1 1 254 255 -23330=5,3,40,40,1,64
Convolution              conv_67                  1 1 255 256 -23330=5,3,40,40,1,64 0=64 1=1 5=1 6=4096
Reshape                  reshape_168              1 1 256 257 -23330=5,2,1600,64,1,1 0=1600 1=64
Convolution              conv_68                  1 1 212 258 -23330=5,3,20,20,1,64 0=64 1=3 4=1 5=1 6=73728
Swish                    silu_147                 1 1 258 259 -23330=5,3,20,20,1,64
Convolution              conv_69                  1 1 259 260 -23330=5,3,20,20,1,64 0=64 1=3 4=1 5=1 6=36864
Swish                    silu_148                 1 1 260 261 -23330=5,3,20,20,1,64
Convolution              conv_70                  1 1 261 262 -23330=5,3,20,20,1,64 0=64 1=1 5=1 6=4096
Reshape                  reshape_169              1 1 262 263 -23330=5,2,400,64,1,1 0=400 1=64
Convolution              conv_71                  1 1 249 264 -23330=5,3,10,10,1,64 0=64 1=3 4=1 5=1 6=147456
Swish                    silu_149                 1 1 264 265 -23330=5,3,10,10,1,64
Convolution              conv_72                  1 1 265 266 -23330=5,3,10,10,1,64 0=64 1=3 4=1 5=1 6=36864
Swish                    silu_150                 1 1 266 267 -23330=5,3,10,10,1,64
Convolution              conv_73                  1 1 267 268 -23330=5,3,10,10,1,64 0=64 1=1 5=1 6=4096
Reshape                  reshape_170              1 1 268 269 -23330=5,2,100,64,1,1 0=100 1=64
Concat                   cat_17                   3 1 257 263 269 270 -23330=5,2,2100,64,1,1 0=1
ConvolutionDepthWise     convdw_183               1 1 193 271 -23330=5,3,40,40,1,64 0=64 1=3 4=1 5=1 6=576 7=64
Swish                    silu_151                 1 1 271 272 -23330=5,3,40,40,1,64
Convolution              conv_74                  1 1 272 273 -23330=5,3,40,40,1,64 0=64 1=1 5=1 6=4096
Swish                    silu_152                 1 1 273 274 -23330=5,3,40,40,1,64
ConvolutionDepthWise     convdw_184               1 1 274 275 -23330=5,3,40,40,1,64 0=64 1=3 4=1 5=1 6=576 7=64
Swish                    silu_153                 1 1 275 276 -23330=5,3,40,40,1,64
Convolution              conv_75                  1 1 276 277 -23330=5,3,40,40,1,64 0=64 1=1 5=1 6=4096
Swish                    silu_154                 1 1 277 278 -23330=5,3,40,40,1,64
Convolution              conv_76                  1 1 278 279 -23330=5,3,40,40,1,5 0=5 1=1 5=1 6=320
Reshape                  reshape_171              1 1 279 280 -23330=5,2,1600,5,1,1 0=1600 1=5
ConvolutionDepthWise     convdw_185               1 1 214 281 -23330=5,3,20,20,1,128 0=128 1=3 4=1 5=1 6=1152 7=128
Swish                    silu_155                 1 1 281 282 -23330=5,3,20,20,1,128
Convolution              conv_77                  1 1 282 283 -23330=5,3,20,20,1,64 0=64 1=1 5=1 6=8192
Swish                    silu_156                 1 1 283 284 -23330=5,3,20,20,1,64
ConvolutionDepthWise     convdw_186               1 1 284 285 -23330=5,3,20,20,1,64 0=64 1=3 4=1 5=1 6=576 7=64
Swish                    silu_157                 1 1 285 286 -23330=5,3,20,20,1,64
Convolution              conv_78                  1 1 286 287 -23330=5,3,20,20,1,64 0=64 1=1 5=1 6=4096
Swish                    silu_158                 1 1 287 288 -23330=5,3,20,20,1,64
Convolution              conv_79                  1 1 288 289 -23330=5,3,20,20,1,5 0=5 1=1 5=1 6=320
Reshape                  reshape_172              1 1 289 290 -23330=5,2,400,5,1,1 0=400 1=5
ConvolutionDepthWise     convdw_187               1 1 250 291 -23330=5,3,10,10,1,256 0=256 1=3 4=1 5=1 6=2304 7=256
Swish                    silu_159                 1 1 291 292 -23330=5,3,10,10,1,256
Convolution              conv_80                  1 1 292 293 -23330=5,3,10,10,1,64 0=64 1=1 5=1 6=16384
Swish                    silu_160                 1 1 293 294 -23330=5,3,10,10,1,64
ConvolutionDepthWise     convdw_188               1 1 294 295 -23330=5,3,10,10,1,64 0=64 1=3 4=1 5=1 6=576 7=64
Swish                    silu_161                 1 1 295 296 -23330=5,3,10,10,1,64
Convolution              conv_81                  1 1 296 297 -23330=5,3,10,10,1,64 0=64 1=1 5=1 6=4096
Swish                    silu_162                 1 1 297 298 -23330=5,3,10,10,1,64
Convolution              conv_82                  1 1 298 299 -23330=5,3,10,10,1,5 0=5 1=1 5=1 6=320
Reshape                  reshape_173              1 1 299 300 -23330=5,2,100,5,1,1 0=100 1=5
Concat                   cat_18                   3 1 280 290 300 301 -23330=5,2,2100,5,1,1 0=1
Reshape                  reshape_174              1 1 270 302 -23330=5,3,2100,16,1,4 0=2100 1=16 2=4
Permute                  transpose_181            1 1 302 303 -23330=5,3,2100,4,1,16 0=2
Softmax                  softmax_2                1 1 303 304 -23330=5,3,2100,4,1,16
Convolution              conv_83                  1 1 304 305 -23330=5,3,2100,4,1,1 0=1 1=1 6=16
Reshape                  reshape_175              1 1 305 306 -23330=5,2,2100,4,1,1 0=2100 1=4
MemoryData               pnnx_fold_anchor_points.1 0 1 307 -23330=5,2,2100,2,1,1 0=2100 1=2
Split                    splitncnn_0              1 2 307 308 309 -23330=10,2,2100,2,1,1,2,2100,2,1,1
Slice                    chunk_0                  1 2 306 310 311 -23330=10,2,2100,2,1,1,2,2100,2,1,1 -23300=2,-233,-233
BinaryOp                 sub_15                   2 1 308 310 312 -23330=5,2,2100,2,1,1 0=1
Split                    splitncnn_27             1 2 312 313 314 -23330=10,2,2100,2,1,1,2,2100,2,1,1
BinaryOp                 add_16                   2 1 309 311 315 -23330=5,2,2100,2,1,1
Split                    splitncnn_28             1 2 315 316 317 -23330=10,2,2100,2,1,1,2,2100,2,1,1
BinaryOp                 add_17                   2 1 313 316 318 -23330=5,2,2100,2,1,1
BinaryOp                 div_18                   1 1 318 319 -23330=5,2,2100,2,1,1 0=3 1=1 2=2.000000e+00
BinaryOp                 sub_19                   2 1 317 314 320 -23330=5,2,2100,2,1,1 0=1
Concat                   cat_19                   2 1 319 320 321 -23330=5,2,2100,4,1,1
Reshape                  reshape_176              1 1 251 322 -23330=5,2,2100,1,1,1 0=2100 1=1
BinaryOp                 mul_20                   2 1 321 322 323 -23330=5,2,2100,4,1,1 0=2
Sigmoid                  sigmoid_0                1 1 301 324 -23330=5,2,2100,5,1,1
Concat                   cat_20                   2 1 323 324 out0 -23330=5,2,2100,9,1,1
